# Week 4: Data Merging and Concatenation


## Objectives:
In this week, you will:
1. Learn how to merge datasets using different join techniques.
2. Practice concatenating datasets to combine data from multiple sources.
3. Understand how to handle complex merges with multiple keys.


## 1. Data Merging Basics
Merging datasets is an essential step when you need to combine data from different sources. In `pandas`, merging can be done using different join techniques, similar to SQL joins.

### Common Join Types:
- **Inner Join**: Only includes rows with matching keys in both datasets.
- **Left Join**: Includes all rows from the left dataset, and matching rows from the right.
- **Right Join**: Includes all rows from the right dataset, and matching rows from the left.
- **Outer Join**: Includes all rows from both datasets, filling in `NaN` where there's no match.

Let's start by loading two sample datasets and performing different types of joins.

In [1]:

# Import pandas
import pandas as pd

# Sample dataset 1: Tourism data
tourism_data = {
    'Location': ['Park A', 'Museum B', 'Beach C'],
    'Visitors': [200, 150, 100]
}

df_tourism = pd.DataFrame(tourism_data)

# Sample dataset 2: Revenue data
revenue_data = {
    'Location': ['Park A', 'Museum B', 'Beach C', 'Zoo D'],
    'Revenue': [1000, 750, 500, 300]
}

df_revenue = pd.DataFrame(revenue_data)

# Display the datasets
df_tourism, df_revenue

(   Location  Visitors
 0    Park A       200
 1  Museum B       150
 2   Beach C       100,
    Location  Revenue
 0    Park A     1000
 1  Museum B      750
 2   Beach C      500
 3     Zoo D      300)


## 2. Inner Join
An inner join combines the two datasets based on a common key, only including rows where there are matches in both datasets.

Let's perform an inner join on the `Location` column.

In [2]:

# Perform an inner join on 'Location'
df_inner = pd.merge(df_tourism, df_revenue, on='Location', how='inner')

# Show the result
df_inner

   Location  Visitors  Revenue
0    Park A       200     1000
1  Museum B       150      750
2   Beach C       100      500


## 3. Left Join
A left join returns all rows from the left dataset and the matching rows from the right dataset. Rows from the left dataset without a match in the right will have `NaN` values.

Let's perform a left join on the `Location` column.

In [3]:

# Perform a left join on 'Location'
df_left = pd.merge(df_tourism, df_revenue, on='Location', how='left')

# Show the result
df_left

   Location  Visitors  Revenue
0    Park A       200     1000
1  Museum B       150      750
2   Beach C       100      500


## 4. Right Join
A right join returns all rows from the right dataset and the matching rows from the left dataset. Rows from the right dataset without a match in the left will have `NaN` values.

Let's perform a right join on the `Location` column.

In [4]:

# Perform a right join on 'Location'
df_right = pd.merge(df_tourism, df_revenue, on='Location', how='right')

# Show the result
df_right

   Location  Visitors  Revenue
0    Park A     200.0     1000
1  Museum B     150.0      750
2   Beach C     100.0      500
3     Zoo D       NaN      300


## 5. Outer Join
An outer join returns all rows from both datasets, filling in `NaN` where no match is found.

Let's perform an outer join on the `Location` column.

In [5]:

# Perform an outer join on 'Location'
df_outer = pd.merge(df_tourism, df_revenue, on='Location', how='outer')

# Show the result
df_outer

   Location  Visitors  Revenue
0    Park A     200.0     1000
1  Museum B     150.0      750
2   Beach C     100.0      500
3     Zoo D       NaN      300


## 6. Concatenating Datasets
Concatenation allows you to combine datasets vertically or horizontally. This is useful when you have multiple datasets with the same structure and want to append them together.

Let's concatenate two tourism datasets.

In [6]:

# Sample dataset 3: Additional tourism data
more_tourism_data = {
    'Location': ['Zoo D', 'Museum E'],
    'Visitors': [180, 120]
}

df_more_tourism = pd.DataFrame(more_tourism_data)

# Concatenate the two tourism datasets
df_concat = pd.concat([df_tourism, df_more_tourism], ignore_index=True)

# Show the result
df_concat

   Location  Visitors
0    Park A       200
1  Museum B       150
2   Beach C       100
3     Zoo D       180
4  Museum E       120


## 7. Summary
In this week, you learned how to:
1. Merge datasets using different join techniques (inner, left, right, outer).
2. Concatenate datasets to combine multiple sources of data.

### Homework:
- Practice merging datasets from different sources in your own project.
- Use concatenation to combine datasets from multiple time periods or locations.